[
    {
        "Target Industries": "Technology, Industrial, Life Sciences, Financial Services. (Large sales organisations, multi-site and region, multi-stakeholder, complex, protracted sales process).",
        "Target Audience": {
            "1": "Commercial-buyers – CEO (50% of conversations are with CEO), CRO, CSO, Sales Leaders.",
            "2": "Influencer-buyers - Sales Enablement (Performance development, Service/technology review), CHRO (Advocate/sponsor/aligns with 'people' component of the capability), IT (Potential blocker)."
        },
        "SMP": "Korn Ferry's Sales Effectiveness delivers the only comprehensive solution for changing seller behavior.",
        "Key Takeaway": "Korn Ferry drives world-class sales performance by identifying and hiring the best people, designing the ideal organization, and enabling them with the methodology and technology to perform at an elite level and outperform their competition.",
        "Main Message": "Korn Ferry challenges the traditional assumptions and approaches of sales training from the outset—believing that elite performance is only achieved by combining the best talent and sales methodology—amplified with the most advanced technology. Our performance model incorporates organizational effectiveness consulting with proven methodology, coaching, and training to change seller behavior, as well as CRM-integrated technology to lock in that behavior and deliver data to support future Generative AI applications.",
        "Pillars": [
            "Talent Excellence",
            "Organizational Effectiveness",
            "Precise Execution"
        ]
    },
    {
        "Connecting the client's needs and the Korn Ferry Sales Effectiveness solution": {
            "Talent Excellence": [
                "Our clients need the best talent in the right roles, isolating critical skills that really lead to success.",
                "Understanding what sales effectiveness must achieve for our client, we profile and identify the best people to deliver it – now and for the future.",
                "We assess who they have and who should be developed against our clients' 'success profile' – a dynamic benchmark that shows what traits your team needs to have to get your organization to its goals – and help to retain them."
            ],
            "Organizational Effectiveness": [
                "Our clients need the right people with the right structure and organization around them to optimize their performance.",
                "We design your sales organization to support efficient sales processes for optimal performance.",
                "Then ensure that teams’ rewards are aligned to drive performance.",
                "Finally, we embed and sustain the performance improvement with world class change and communication."
            ],
            "Precise Execution": [
                "Our clients need sales technology that drives competitive advantage.",
                "Our methodology uses sales-proven approaches to develop elite sellers. Repeatable, scalable, predictable operating methods that determine the organization's ability to achieve sales effectiveness and improve win rates.",
                "Our clients need accurate sales data for superior decision-making.",
                "Understanding and predicting outcomes of sales activity and forecasting with greater accuracy are critical for success.",
                "Our approach enables consistent selling behaviours supported by CRM-integrated technology to ensure reliable data – including win rates, deal sizes, and funnel velocity – for robust forecasting and strategic planning.",
                "Integrating key metrics and insights supports decision-making and optimizes performance."
            ]
        }
    },
    {
        "Positioning": {
            "Korn Ferry": [
                "As a people specialist with expertise and a data-led strong view of the talent foundations needed to accelerate sales effectiveness.",
                "As an organizational design specialist, we align organizational capabilities, structure, and roles with business strategy and design, analyze, and measure work to optimize how work gets done in organizations.",
                "As a methodology expert with IP proven in sales organizations and a laser focus on elevating sellers to elite performers through real-time coaching, and sales learning.",
                "As an insight leader, giving organizations sales-data enriched with Generative AI - offering real time in the moment insights for strategic decision-making."
            ]
        },
        "Key Messages and Proof Points": {
            "Success profiling": {
                "Message": "Crafting and applying Success Profiles to ensure that sales teams are composed of individuals whose capabilities, skills and experiences are aligned with the company's strategic goals.",
                "Proof-points": "Sales organizations who have a clear understanding of what “good” looks like for their sales roles achieve superior performance across the board: +8% revenue attainment, +25% quota attainment and +17% win rates. (Korn Ferry Sales Maturity Survey 2024)"
            },
            "Restructuring around Gen-AI to drive efficiencies": {
                "Message": "Bringing in new tools like generative-AI means that jobs and roles will change within the organization. This means that the organizational design likely needs changing too to support different ways of doing work."
            }
        }
    },
    {
        "Key Messages and Proof Points": {
            "CRM integration and enhancement": {
                "Message": "Korn Ferry Sell seamlessly integrates with existing CRM systems, enhancing usability and ensuring that KF sales methodology is embedded into daily sales activities.",
                "Proof-points": "Our solution takes the empirically proven Miller Heiman sales methodology and gives it renewed relevancy in a powerful new digital environment with advanced analytics and AI. After implementing KF Sell, a global mining company is projected to see a 20% or more increase in win rates. KF case study, Hexagon."
            },
            "Enhanced forecasting accuracy = growth": {
                "Message": "Leveraging the power of CRM-integrated analytics, KF Sell provides sales teams with the tools to enhance the accuracy of sales forecasting, enabling more strategic decision-making and resource allocation.",
                "Proof-points": "Incoming data quality is reflected in meaningful forecasting and reporting. All deals and team members are accounted for; we benchmark your team against top orgs using diagnostics, roadmaps, heatmaps, and ROI models. Having a rigorous forecasting process that drives forecast accuracy reaps dividends, linked to 21% higher quota attainment, 18% higher win rates, and 25% lower customer churn. (Korn Ferry Sales Maturity Survey 2024)"
            },
            "Talent optimization": {
                "Message": "Leveraging deep industry insights to match the best talent with the right roles, enhancing team dynamics and sales outcomes.",
                "Proof-points": "Fit to role is important. KFI research shows that people who are a strong fit to their success profile are 7.5x more likely to be highly engaged by their role. They are likely to work harder, collaborate more and look after customers better. Source: KF Assess."
            },
            "Human-centric, technology-integrated": {
                "Message": "Technology is most powerful when driven by human insight. Our methodology and technological solutions are underpinned by a deep understanding of people and their behaviours, enabling us to enhance sales effectiveness uniquely. This approach ensures that our technological implementations are advanced, intuitive, and aligned with natural human behaviours and needs.",
                "Proof-points": "We use our extensive People Strategy, Organizational Design, Workforce and Career Architecture expertise to shape high-performance sales organizations. By aligning people, structures, and culture, we ensure your sales force is primed to exceed business objectives."
            },
            "Enhanced customer engagement": {
                "Message": "By providing sales teams with comprehensive customer insights and history, KF Sell enables more meaningful and effective customer interactions.",
                "Proof-points": "The 12% of sales organizations who say that their salespeople demonstrate perspective selling report 16% higher quota attainment, 22% higher win rates and 10% higher revenue attainment than those organizations whose salespeople either lack selling skills or only have foundational selling skills. They also report 35% lower voluntary turnover. (Korn Ferry Sales Maturity Survey 2024)"
            }
        }
    },
    {
        "Key Messages and Proof Points": {
            "Real-time sales metrics": {
                "Message": "KF Sell offers real-time access to critical sales metrics, empowering sales leaders and teams to make data-driven decisions swiftly and effectively.",
                "Proof-points": "Those sales organizations who state they have an effective funnel management review process which accelerates sales cycles achieve 8% higher revenue attainment, 13% higher quota attainment and 14% higher win rates than those who do not. (Korn Ferry Sales Maturity Survey 2024)"
            },
            "Predictive talent analytics": {
                "Message": "Using advanced analytics to predict future sales success and identify top performers' behavioural and cognitive traits.",
                "Proof-points": "Sales organizations who use a predictive hiring assessment tool to evaluate candidates for sales roles report 44% lower involuntary turnover and 24% lower voluntary turnover. They also have 23% more salespeople achieve their full quota (Korn Ferry Sales Maturity Survey 2024)"
            },
            "Commercial performance model": {
                "Message": "Covers talent, sales operations, methodologies, and technology. Constructed around a 15-box matrix, it provides a clear structure for analysing and improving sales performance across different dimensions.",
                "Proof-points": "15 box CPM and corresponding data nuggets on a separate document here: https://kornferry.sharepoint.com/:w:/s/SalesMaturityDiagnostic-KFI/EfAumLDKt1tCoQRf2VZcF48Bkr6csHEgREydlV4FLDczlA?e=9H8He1"
            },
            "Data-driven insights": {
                "Message": "Delivering actionable insights directly to sales teams, enabling them to make informed decisions, prioritize opportunities and redistribute their time to ensure they’re laser focused.",
                "Proof-points": "Using KF Sell on Sales Cloud to drive new account and opportunity management behaviours through CRM, a smart home technology company saw a >$300 million worth of potential sales identified and fed into pipeline and 17% sales upside opportunity."
            },
            "Increase retention with stronger match to role": {
                "Message": "Based on the needs of the organization, identify success profiles, create a new success profile, or run full predictive regression analysis to understand the right skills, capabilities and traits from assessments. This sets the foundation for your talent, guides how to develop them and increases retention of the right people.",
                "Proof-points": "Sales organizations who have a clear understanding of what “good” looks like for their sales roles report 17% lower voluntary and 20% lower involuntary turnover. (Korn Ferry Sales Maturity Survey 2024)"
            }
        }
    },
    {
        "Key Messages and Proof Points": {
            "Repeatable Success": {
                "Message": "Creating scalable and repeatable sales processes that ensure consistency and reliability in sales execution.",
                "Proof-points": "Sales organizations who follow a dynamic sales process (vs. a random / informal sales process) achieve gains across the board: +7% revenue attainment, +11% quota attainment, +25% win rates, -26% customer churn and -24% voluntary turnover (Korn Ferry Sales Maturity Survey 2024) underscoring the effectiveness of repeatable and reliable sales execution."
            },
            "Strategic sales methodology": {
                "Message": "Our consistent methodology powered by Miller Heiman, is the go-to framework for companies around the world. It is designed to help organizations manage complex sales processes involving multiple decision-makers.",
                "Proof Points": "After implementing KF sales methodology (Miller Heiman), an international professional services firm reported 20% YOY revenue growth w/new & existing clients. KF case study, global professional services firm."
            },
            "Data-driven sales strategies": {
                "Message": "By integrating comprehensive sales data into strategic planning, KF Sell empowers sales teams to develop and implement more effective, data-driven sales strategies.",
                "Proof Points": "Best-in-Class organizations are nearly twice as likely to agree that their sales management uses data effectively to make decisions related to sales performance and talent management. This practice is linked to 17% higher quota attainment and 15% higher win rates. (Korn Ferry Sales Maturity Survey 2024)"
            },
            "Continuous sales process optimization": {
                "Message": "Continuous analysis of sales data through KF Sell allows for ongoing optimization of sales processes, ensuring they remain aligned with market changes and business objectives.",
                "Proof-points": "Best-in-Class organizations are nearly 4X more likely than their peers to report updating their sales process both as part of annual planning cycle and as needed based on market factors throughout the year. Dynamically updating the sales process is linked to 30% higher win rates. (Korn Ferry Sales Maturity Survey 2024)"
            }
        }
    },
    {
        "Key Messages and Proof Points": {
            "Scalability and adaptability": {
                "Message": "KF Sell is engineered to evolve with your organization. It adapts swiftly to shifts in your sales strategies and scales to support new users, ensuring that your sales methodologies remain uniform and effective across all levels of your changing business.",
                "Proof-points": "After implementing KF Sell, a global mining company is projected to see 13% higher quota attainment. KF case study, Hexagon."
            },
            "High value moments with customers": {
                "Message": "KF Sell enhances CRM capabilities by providing deeper insights into customer behaviours and needs, facilitating more personalized and effective sales approaches.",
                "Proof Points": "The positive effect that deep client relationships have on performance has been documented throughout years of Korn Ferry sales performance research. This year, we saw Trusted Partners achieve 48% higher quota attainment and 25% higher win rates than Approved Vendors. (Korn Ferry Sales Maturity Survey 2024)"
            },
            "Sales compensation": {
                "Message": "The right compensation and incentives motivate teams and attract the right type of talent. Our consultants design comprehensive sales compensation models that meet the needs of your entire sales force.",
                "Proofpoint": "Enhanced seller behaviour : Focusing on changing seller behaviours across the organization to align with proven sales processes and strategies that meet the modern buyer's expectations."
            },
            "Empowered sales managers": {
                "Message": "Training sales leaders to coach and support their teams effectively, driving performance and accountability.",
                "Proof-points": "Sales organizations who agree that their sales managers provide adequate resources and support to enable the sales team to meet their targets have 14% higher quota attainment and 2X higher seller engagement. (Korn Ferry Sales Maturity Survey 2024)"
            }
        }
    },
    {
        "Key Messages and Proof Points": {
            "Sales process automation": {
                "Message": "Automating routine tasks and providing sales teams with guided selling based on proven methodologies, allowing them to focus more on selling and less on administrative tasks.",
                "Proof-points": "Sellers whose organization follows a dynamic sales methodology (vs random) spend 32% more of their time selling. (Korn Ferry Sales Maturity Survey 2024)"
            },
            "Integration with Technology": {
                "Message": "Enhancing the effectiveness of sales methodologies through integration with CRM and other sales enablement technologies.",
                "Proof-points": "In a recent study captured in the 2024 Korn Ferry Sales Maturity Survey, sales teams that combined dynamic sales methodologies with a CRM adoption rate of over 75% achieved win rates that were four times higher than those using CRM alone."
            },
            "Generative AI removes administrative burden": {
                "Message": "Technology must serve sellers, removing whatever slows them—and giving them time and insight to win more business.",
                "Proof-points": "Our solution enhances their experience, integrating with existing CRM systems to streamline activity and capture interactions—locking-in methodology through coaching. Simultaneously, it supports future Generative AI to augment sales activity with invaluable data and identify patterns and insights."
            },
            "Superior deal reviews and forecasting": {
                "Message": "Create an operating cadence for success with a methodology for deal reviews or for accurate forecasting to drive improved operational performance.",
                "Proof-points": "Having a rigorous forecast and review process links to higher quota attainment and more reliable deal closures, enhancing performance across sales teams."
            },
            "Assessing talent to inform development": {
                "Message": "Understand the capabilities of your team through the use of assessments and success profiles to help shape continuous, targeted development to hone the skills and knowledge of sales personnel to meet evolving market demands.",
                "Proof-points": "After participating in Korn Ferry's ongoing sales training programs, 70% of attendees from a French multinational biotechnology company anticipated significant job performance improvements, rating the impact of the training at a robust six on a seven-point scale."
            }
        }
    },
    {
        "Key Messages and Proof Points": {
            "Strategic talent development": {
                "Message": "Using assessments, provide continuous, targeted development to hone the skills and knowledge of sales personnel to meet evolving market demands.",
                "Proof-points": "After participating in Korn Ferry's ongoing sales training programs, 70% of attendees from a French multinational biotechnology company anticipated significant job performance improvements, rating the impact of the training at a robust six on a seven-point scale."
            },
            "Continuous improvement and learning": {
                "Message": "Embedding continuous learning and improvement within the sales process, KF Sell provides real-time feedback and coaching suggestions to improve sales techniques and outcomes.",
                "Proof-points": "Those organizations who report that their sales teams have access to sales training and development resources that are available on-demand achieve +18% win rates, +8% revenue attainment and +53% seller engagement (Korn Ferry Sales Maturity Survey 2024)."
            },
            "Change without disruption": {
                "Message": "Achieving value realization through seamless integration of sales methodology and skills development directly within the flow of sales activities. Korn Ferry ensures transformation occurs with ongoing sales efforts, preventing downtime and maintaining productivity.",
                "Proof-points": "Deployment of sales methodology as part of an end-to-end sales transformation delivered a $6.5bn increase in top-line revenues and a doubling of the win rate increase (from 30% to over 60%). KF case study, Professional Services firm."
            }
        },
        "Culture": {
            "High-performance sales culture": {
                "Message": "Establishing a culture of high performance, accountability, and continuous improvement that drives sales success from within.",
                "Proof-points": "Sales organizations who agree that their sales leaders promote a culture of accountability and ownership within the sales team achieve 19% higher quota attainment and 22% higher win rates (Korn Ferry Sales Maturity Survey 2024)."
            },
            "Leadership alignment": {
                "Message": "Aligning sales leadership and strategy to ensure that the entire organization is geared toward effectively supporting the sales function.",
                "Proof-points": "Sales organizations who agree that their sales leaders provide adequate resources and support to enable the sales team to meet their targets have 14% higher quota attainment and 2X higher seller engagement (Korn Ferry Sales Maturity Survey 2024)."
            }
        },
        "Usage Models": "In the context of a messaging framework, usage models generally refer to the different ways a product or service can be used by customers."
    }
]
